
// 이진탐색 예제
// 출처: 이코테 - 나동빈 저

import Foundation

// 1번
/*
 전자매장에는 부품이 N개 있다.
 각 부품은 정수 형태의 고유한 번호가 있다. 오느날 손님이 M개 종류의 부품을 대량으로 구매하겠다며 당일 날 견적서를 요청했다.
 나는 떄를 놓치지 않고 손님이 문의한 부품 M개 종류를 모두 확인해서 견적서를 작성해야 한다.
 이때 가게 안에 부품이 모두 있는지 확인하는 프로그램을 작성하라.
 
 가게가 현재 포유한 부품이 총 5개일 때 부품의 번호는 다음와 같다.
 N = 5
 [8, 3, 7, 9, 2]
 
 손님은 총 3개의 부품이 있는지 확인 요청했는데 부품 번호는 다음과 같다.
 M = 3
 [5, 7, 9]
 
 손님이 요청한 부품 번호의 순서대로 부품을 확인해 부품이 있으면 yes, 없으면 no를 출력하라.
 */

func sol1() {
    
}


// 2번
/*
 떡볶이의 떡을 만드는데, 떡의 길이가 일정하지 않다.
 대신에 한 봉지 안에 들어가는 떡의 총 길이는 절단기로 잘라서 맞춘다.
 절단기에 높이 H를 지정하면 줄지어진 떡을 한번에 절단한다.
 높이가 H보다 긴 떡은 H 윗부분이 잘릴 것이고, 낮은 떡은 잘리지 않는다.
 
 예를 들어, 높이가 19, 14, 10, 17인 떡이 나란히 있고,
 절단기 높이를 15로 하면 잘린 떡의 길이는 4, 0, 0, 2 일 것이다.
 손님이 왔을 때 요청한 총 길이가 M일 때,
 적어도 M 만큼의 떡을 얻기 위해 설정할 수 있는 절단기의 높이의 최댓값을 구하라.
 */

func sol2() {
    
}
